// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
// [345, 897, 568, 234] -> 2
/*
int size = new Random().Next(1, 10);

int[] RandomArray (int length)
{
    int[] array = new int[length];
    for(int i = 0; i < length; i++)
        array[i] = new Random().Next(100, 1000);
    return array;
}

int CountEven (int[] arr)
{
    int result = 0;
    for(int i = 0; i < arr.Length; i++)
    {
        if (arr[i] % 2 == 0)
            result++;
    }
    return result;
}

Console.WriteLine(CountEven(RandomArray(size)));
*/

// Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.
// [3, 7, 23, 12] -> 19
// [-4, -6, 89, 6] -> 0





// Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.
// [3 7 22 2 78] -> 76



